balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256GA106.PIC
        <edc:SFRDef edc:access="--n----n----nnn-" edc:cname="IFS4" edc:desc="" edc:impl="0x210e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0----0----000-" edc:name="IFS4" edc:nzwidth="0x10" edc:por="--0----0----000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U1ERIF" edc:desc="" edc:mask="0x1" edc:name="U1ERIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2ERIF" edc:desc="" edc:mask="0x1" edc:name="U2ERIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIF" edc:desc="" edc:mask="0x1" edc:name="CRCIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="LVDIF" edc:desc="" edc:mask="0x1" edc:name="LVDIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CTMUIF" edc:desc="" edc:mask="0x1" edc:name="CTMUIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnn-nnnnn-" edc:cname="IFS5" edc:desc="" edc:impl="0x3ffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0000000-00000-" edc:name="IFS5" edc:nzwidth="0x10" edc:por="--0000000-00000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U3ERIF" edc:desc="" edc:mask="0x1" edc:name="U3ERIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXIF" edc:desc="" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3TXIF" edc:desc="" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SI2C3IF" edc:desc="" edc:mask="0x1" edc:name="SI2C3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C3IF" edc:desc="" edc:mask="0x1" edc:name="MI2C3IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U4ERIF" edc:desc="" edc:mask="0x1" edc:name="U4ERIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4RXIF" edc:desc="" edc:mask="0x1" edc:name="U4RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4TXIF" edc:desc="" edc:mask="0x1" edc:name="U4TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPF3IF" edc:desc="" edc:mask="0x1" edc:name="SPF3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI3IF" edc:desc="" edc:mask="0x1" edc:name="SPI3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC9IF" edc:desc="" edc:mask="0x1" edc:name="OC9IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC9IF" edc:desc="" edc:mask="0x1" edc:name="IC9IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="--nnnnnnnnn-nnnn" edc:cname="IEC0" edc:desc="" edc:impl="0x3fef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000000-0000" edc:name="IEC0" edc:nzwidth="0x10" edc:por="--000000000-0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPF1IE" edc:desc="" edc:mask="0x1" edc:name="SPF1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IE" edc:desc="" edc:mask="0x1" edc:name="SPI1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXIE" edc:desc="" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIE" edc:desc="" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD1IE" edc:desc="" edc:mask="0x1" edc:name="AD1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-nn-nnnnn" edc:cname="IEC1" edc:desc="" edc:impl="0xfedf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000-00-00000" edc:name="IEC1" edc:nzwidth="0x10" edc:por="0000000-00-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SI2C1IE" edc:desc="" edc:mask="0x1" edc:name="SI2C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C1IE" edc:desc="" edc:mask="0x1" edc:name="MI2C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMIE" edc:desc="" edc:mask="0x1" edc:name="CMIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNIE" edc:desc="" edc:mask="0x1" edc:name="CNIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC7IE" edc:desc="" edc:mask="0x1" edc:name="IC7IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC8IE" edc:desc="" edc:mask="0x1" edc:name="IC8IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC4IE" edc:desc="" edc:mask="0x1" edc:name="OC4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXIE" edc:desc="" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIE" edc:desc="" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnnnn---nn" edc:cname="IEC2" edc:desc="" edc:impl="0x3fe3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000000---00" edc:name="IEC2" edc:nzwidth="0x10" edc:por="--000000000---00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPF2IE" edc:desc="" edc:mask="0x1" edc:name="SPF2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2IE" edc:desc="" edc:mask="0x1" edc:name="SPI2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC4IE" edc:desc="" edc:mask="0x1" edc:name="IC4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC5IE" edc:desc="" edc:mask="0x1" edc:name="IC5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC6IE" edc:desc="" edc:mask="0x1" edc:name="IC6IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC5IE" edc:desc="" edc:mask="0x1" edc:name="OC5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC6IE" edc:desc="" edc:mask="0x1" edc:name="OC6IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC7IE" edc:desc="" edc:mask="0x1" edc:name="OC7IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC8IE" edc:desc="" edc:mask="0x1" edc:name="OC8IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMPIE" edc:desc="" edc:mask="0x1" edc:name="PMPIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n-------nn--nn-" edc:cname="IEC3" edc:desc="" edc:impl="0x4066" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0-------00--00-" edc:name="IEC3" edc:nzwidth="0x10" edc:por="-0-------00--00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SI2C2IE" edc:desc="" edc:mask="0x1" edc:name="SI2C2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C2IE" edc:desc="" edc:mask="0x1" edc:name="MI2C2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="RTCIE" edc:desc="" edc:mask="0x1" edc:name="RTCIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--n----n----nnn-" edc:cname="IEC4" edc:desc="" edc:impl="0x210e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0----0----000-" edc:name="IEC4" edc:nzwidth="0x10" edc:por="--0----0----000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U1ERIE" edc:desc="" edc:mask="0x1" edc:name="U1ERIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2ERIE" edc:desc="" edc:mask="0x1" edc:name="U2ERIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIE" edc:desc="" edc:mask="0x1" edc:name="CRCIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="LVDIE" edc:desc="" edc:mask="0x1" edc:name="LVDIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CTMUIE" edc:desc="" edc:mask="0x1" edc:name="CTMUIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnn-nnnnn-" edc:cname="IEC5" edc:desc="" edc:impl="0x3ffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0000000-00000-" edc:name="IEC5" edc:nzwidth="0x10" edc:por="--0000000-00000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U3ERIE" edc:desc="" edc:mask="0x1" edc:name="U3ERIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXIE" edc:desc="" edc:mask="0x1" edc:name="U3RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3TXIE" edc:desc="" edc:mask="0x1" edc:name="U3TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SI2C3IE" edc:desc="" edc:mask="0x1" edc:name="SI2C3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C3IE" edc:desc="" edc:mask="0x1" edc:name="MI2C3IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U4ERIE" edc:desc="" edc:mask="0x1" edc:name="U4ERIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4RXIE" edc:desc="" edc:mask="0x1" edc:name="U4RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4TXIE" edc:desc="" edc:mask="0x1" edc:name="U4TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPF3IE" edc:desc="" edc:mask="0x1" edc:name="SPF3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI3IE" edc:desc="" edc:mask="0x1" edc:name="SPI3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC9IE" edc:desc="" edc:mask="0x1" edc:name="OC9IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC9IE" edc:desc="" edc:mask="0x1" edc:name="IC9IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="-nnn-nnn-nnn-nnn" edc:cname="IPC0" edc:desc="" edc:impl="0x7777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuu-uuu-uuu-uuu" edc:name="IPC0" edc:nzwidth="0x10" edc:por="-100-100-100-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IP" edc:desc="" edc:mask="0x7" edc:name="INT0IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC1IP" edc:desc="" edc:mask="0x7" edc:name="IC1IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OC1IP" edc:desc="" edc:mask="0x7" edc:name="OC1IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1IP" edc:desc="" edc:mask="0x7" edc:name="T1IP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT0IP0" edc:desc="" edc:mask="0x1" edc:name="INT0IP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0IP1" edc:desc="" edc:mask="0x1" edc:name="INT0IP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0IP2" edc:desc="" edc:mask="0x1" edc:name="INT0IP2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC1IP0" edc:desc="" edc:mask="0x1" edc:name="IC1IP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC1IP1" edc:desc="" edc:mask="0x1" edc:name="IC1IP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC1IP2" edc:desc="" edc:mask="0x1" edc:name="IC1IP2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OC1IP0" edc:desc="" edc:mask="0x1" edc:name="OC1IP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1IP1" edc:desc="" edc:mask="0x1" edc:name="OC1IP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1IP2" edc:desc="" edc:mask="0x1" edc:name="OC1IP2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1IP0" edc:desc="" edc:mask="0x1" edc:name="T1IP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1IP1" edc:desc="" edc:mask="0x1" edc:name="T1IP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1IP2" edc:desc="" edc:mask="0x1" edc:name="T1IP2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
