balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256GA106.PIC
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR11" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR11" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP22R" edc:desc="" edc:mask="0x3f" edc:name="RP22R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP23R" edc:desc="" edc:mask="0x3f" edc:name="RP23R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP22R0" edc:desc="" edc:mask="0x1" edc:name="RP22R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22R1" edc:desc="" edc:mask="0x1" edc:name="RP22R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22R2" edc:desc="" edc:mask="0x1" edc:name="RP22R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22R3" edc:desc="" edc:mask="0x1" edc:name="RP22R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22R4" edc:desc="" edc:mask="0x1" edc:name="RP22R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP22R5" edc:desc="" edc:mask="0x1" edc:name="RP22R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP23R0" edc:desc="" edc:mask="0x1" edc:name="RP23R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23R1" edc:desc="" edc:mask="0x1" edc:name="RP23R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23R2" edc:desc="" edc:mask="0x1" edc:name="RP23R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23R3" edc:desc="" edc:mask="0x1" edc:name="RP23R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23R4" edc:desc="" edc:mask="0x1" edc:name="RP23R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP23R5" edc:desc="" edc:mask="0x1" edc:name="RP23R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR12" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR12" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP24R" edc:desc="" edc:mask="0x3f" edc:name="RP24R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP25R" edc:desc="" edc:mask="0x3f" edc:name="RP25R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP24R0" edc:desc="" edc:mask="0x1" edc:name="RP24R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24R1" edc:desc="" edc:mask="0x1" edc:name="RP24R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24R2" edc:desc="" edc:mask="0x1" edc:name="RP24R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24R3" edc:desc="" edc:mask="0x1" edc:name="RP24R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24R4" edc:desc="" edc:mask="0x1" edc:name="RP24R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24R5" edc:desc="" edc:mask="0x1" edc:name="RP24R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP25R0" edc:desc="" edc:mask="0x1" edc:name="RP25R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP25R1" edc:desc="" edc:mask="0x1" edc:name="RP25R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP25R2" edc:desc="" edc:mask="0x1" edc:name="RP25R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP25R3" edc:desc="" edc:mask="0x1" edc:name="RP25R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP25R4" edc:desc="" edc:mask="0x1" edc:name="RP25R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP25R5" edc:desc="" edc:mask="0x1" edc:name="RP25R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR13" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR13" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP26R" edc:desc="" edc:mask="0x3f" edc:name="RP26R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP27R" edc:desc="" edc:mask="0x3f" edc:name="RP27R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP26R0" edc:desc="" edc:mask="0x1" edc:name="RP26R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP26R1" edc:desc="" edc:mask="0x1" edc:name="RP26R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP26R2" edc:desc="" edc:mask="0x1" edc:name="RP26R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP26R3" edc:desc="" edc:mask="0x1" edc:name="RP26R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP26R4" edc:desc="" edc:mask="0x1" edc:name="RP26R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP26R5" edc:desc="" edc:mask="0x1" edc:name="RP26R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP27R0" edc:desc="" edc:mask="0x1" edc:name="RP27R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP27R1" edc:desc="" edc:mask="0x1" edc:name="RP27R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP27R2" edc:desc="" edc:mask="0x1" edc:name="RP27R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP27R3" edc:desc="" edc:mask="0x1" edc:name="RP27R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP27R4" edc:desc="" edc:mask="0x1" edc:name="RP27R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP27R5" edc:desc="" edc:mask="0x1" edc:name="RP27R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR14" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR14" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP28R" edc:desc="" edc:mask="0x3f" edc:name="RP28R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP29R" edc:desc="" edc:mask="0x3f" edc:name="RP29R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP28R0" edc:desc="" edc:mask="0x1" edc:name="RP28R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP28R1" edc:desc="" edc:mask="0x1" edc:name="RP28R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP28R2" edc:desc="" edc:mask="0x1" edc:name="RP28R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP28R3" edc:desc="" edc:mask="0x1" edc:name="RP28R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP28R4" edc:desc="" edc:mask="0x1" edc:name="RP28R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP28R5" edc:desc="" edc:mask="0x1" edc:name="RP28R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP29R0" edc:desc="" edc:mask="0x1" edc:name="RP29R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP29R1" edc:desc="" edc:mask="0x1" edc:name="RP29R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP29R2" edc:desc="" edc:mask="0x1" edc:name="RP29R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP29R3" edc:desc="" edc:mask="0x1" edc:name="RP29R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP29R4" edc:desc="" edc:mask="0x1" edc:name="RP29R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP29R5" edc:desc="" edc:mask="0x1" edc:name="RP29R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPOR15" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000" edc:name="RPOR15" edc:nzwidth="0x10" edc:por="----------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP30R" edc:desc="" edc:mask="0x3f" edc:name="RP30R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP30R0" edc:desc="" edc:mask="0x1" edc:name="RP30R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP30R1" edc:desc="" edc:mask="0x1" edc:name="RP30R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP30R2" edc:desc="" edc:mask="0x1" edc:name="RP30R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP30R3" edc:desc="" edc:mask="0x1" edc:name="RP30R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP30R4" edc:desc="" edc:mask="0x1" edc:name="RP30R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP30R5" edc:desc="" edc:mask="0x1" edc:name="RP30R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---------------n" edc:cname="ALTRP" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0" edc:name="ALTRP" edc:nzwidth="16" edc:por="---------------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCK1CM" edc:desc="" edc:mask="0x1" edc:name="SCK1CM" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="92"/>
        <edc:SFRDef edc:access="nn----nnnnnnnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xc0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----0000000011" edc:name="RCON" edc:nzwidth="0x10" edc:por="00----0000000011">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VREGS" edc:desc="" edc:mask="0x1" edc:name="VREGS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM" edc:desc="" edc:mask="0x1" edc:name="CM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOPUWR" edc:desc="" edc:mask="0x1" edc:name="IOPUWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRAPR" edc:desc="" edc:mask="0x1" edc:name="TRAPR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="PMSLP" edc:desc="" edc:mask="0x1" edc:name="PMSLP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
